Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: If an element equal to newMember is already contained in the set, newMember replaces the existing element.
ja: newMemberに等しい要素が既にこの集合に含まれるならば、newMemberは既存の要素と置き換わります。

source: If an element equal to newMember is already contained in the set, this method has no effect.
ja: newMemberに等しい要素が既にこの集合に含まれるならば、このメソッドは効果を持ちません。

source: If an element equal to newMember was already contained in the set, the method returns (false, oldMember), where oldMember is the element that was equal to newMember.
ja: newMemberに等しい要素が既に集合に含まれたならば、メソッドは(false, oldMember)を返します、ここでoldMemberはnewMemberに等しかった要素です。

source: If necessary, the byte order of this value is reversed from the typical byte order of this integer type.
ja: 必要ならば、この値のバイト順はこの整数型の典型的なバイト順からひっくり返されます。

source: If no elements in the collection match belongsInSecondPartition, the returned index is equal to the collection’s endIndex.
ja: コレクションの中の要素が１つもbelongsInSecondPartitionに一致しないならば、返されるインデックスはコレクションのendIndexと等しいです。

source: If no elements in the collection satisfy the given predicate, returns nil.
ja: コレクションの要素が与えられた述部を満たすことがないならば、nilを返します。

source: If no nullability information is provided for a type, Swift doesn't distinguish between optional and nonoptional references, and imports the type as an implicitly unwrapped optional.
ja: ヌル可能性情報がある型に提供されないならば、Swiftはオプショナルと非オプショナル参照の間の区別をしません、そしてその型をある暗黙的にアンラップされるオプショナルとしてインポートしてください。

source: If no such storage exists, it is first created.
ja: そのようなストレージが存在しないならば、それが最初に作成されます。

source: If parts of an Objective-C API aren't suitable for Swift, you can make those parts unavailable in Swift.
ja: Objective-C APIの一部がSwiftに適さないならば、あなたそれらの部分をSwiftで利用可能できなくできます。

source: If the KeyValuePairs instance is empty, endIndex is equal to startIndex.
ja: KeyValuePairsインスタンスが空ならば、endIndexはstartIndexと等しいです。

source: If the KeyValuePairs instance is empty, startIndex is equal to endIndex.
ja: KeyValuePairsインスタンスが空ならば、startIndexはendIndexと等しいです。

source: If the overflow component is false, the partialValue component contains the entire difference.
ja: overflow構成部分がfalseならば、partialValue構成部分は差そのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire product.
ja: overflow構成部分がfalseならば、partialValue構成部分は積そのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire quotient.
ja: overflow構成部分がfalseならば、partialValue構成部分は全体の商を含みます。

source: If the overflow component is false, the partialValue component contains the entire remainder.
ja: overflow構成部分がfalseならば、partialValue構成部分は余りそのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire sum.
ja: overflow構成部分がfalseならば、partialValue構成部分は合計そのままを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains either the truncated quotient or, if the quotient is undefined, the dividend.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こった、そしてpartialValue構成部分は切り詰められた商または、商が未定義ならば、被除数のどちらかを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated product of this value and rhs.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値とrhsの積の切り詰められたものを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated result of rhs subtracted from this value.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値からrhsを減算した結果の切り詰められたもの含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated sum of this value and rhs.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値とrhsの合計の切り詰められたものを含みます。

source: If the overflow component is true, an overflow occurred during division and the partialValue component contains either the entire remainder or, if the remainder is undefined, the dividend.
ja: overflow構成部分がtrueであるならば、除算の間にオーバーフローが起こった、そしてpartialValue構成部分は余りそのまままたは、余りが未定義ならば、被除数のどちらかを含みます。

source: If the bit width of the shifted integer type is a power of two, masking is performed using a bitmask; otherwise, masking is performed using a modulo operation.
ja: シフトされる整数型のビット幅が２の冪ならば、マスクはビットマスクを使って実行されます；そうでなければ、マスクはモジュロ演算を使って実行されます。

source: If the call to this method simply appends the contents of newElements to the collection, the complexity is O(m).
ja: このメソッドへの呼び出しが単にnewElementsの内容をコレクションに追加するだけならば、計算量はO(m)です。

source: If the call to this method simply appends the contents of newElements to the collection, this method is equivalent to append(contentsOf:).
ja: このメソッドへの呼び出しが単にnewElementsの内容をコレクションに追加するだけならば、このメソッドはappend(contentsOf:)と等しいです。

source: If the collection does not have sufficient capacity for another element, additional storage is allocated before appending newElement.
ja: コレクションが別の要素に対して十分な容量を持たないならば、追加のストレージがnewElementを追加する前に割り当てられます。

source: If the collection does not support an internal representation in a form of contiguous storage, body is not called and nil is returned.
ja: コレクションがある内部表現を隣接ストレージの形式でサポートしないならば、bodyは呼び出されません、そしてnilが返されます。

source: If the collection does not support an internal representation in a form of mutable contiguous storage, body is not called and nil is returned.
ja: コレクションがある内部表現を可変の隣接ストレージの形式でサポートしないならば、bodyは呼び出されません、そしてnilが返されます。

source: If the collection is empty, endIndex is equal to startIndex.
ja: コレクションが空ならば、endIndexはstartIndexと等しいです。

source: If the collection is empty, startIndex is equal to endIndex.
ja: コレクションが空ならば、startIndexはendIndexと等しいです。

source: If the collection is empty, the method returns nil.
ja: コレクションが空ならば、このメソッドはnilを返します。

source: If the collection is empty, the value of this property is nil.
ja: コレクションが空であるならば、このプロパティはnilです。

source: If the dynamic type of subject conforms to CustomReflectable, the resulting mirror is determined by its customMirror property.
ja: subjectの動的型がCustomReflectableに準拠するならば、結果として生じるミラーは、それのcustomMirrorプロパティによって決定されます。

source: If the dynamic type of subject has value semantics, subsequent mutations of subject will not observable in Mirror.
ja: subjectの動的な型が値意味論を持つならば、subjectの下位セグメント変異体たちはMirrorの中で見分けがつかないでしょう。

source: If the maximum length exceeds the number of elements in the collection, the result contains all the elements in the collection.
ja: 最大長がコレクションの要素の数を越えるならば、結果はコレクションの要素すべてを含みます。

source: If the maximum length exceeds the number of elements in the collection, the result contains the entire collection.
ja: 最大長がコレクションの要素の数を越えるならば、結果はコレクション全体を含みます。

source: If the maximum length exceeds the number of elements in the sequence, the result contains all the elements in the sequence.
ja: 最大長がシーケンスの要素の数を越えるならば、結果はシーケンスの要素すべてを含みます。

source: If the number of elements to drop exceeds the number of elements in the collection, the result is an empty subsequence.
ja: 省かれることになる要素の数がコレクションの要素の数を越えるならば、結果は空の下位シーケンスです。

source: If the number of elements to drop exceeds the number of elements in the sequence, the result is an empty sequence.
ja: 取り除く要素の数がシーケンスの要素数を越えるならば、結果は空のシーケンスです。

source: If the quotient of dividing dividend by this value is too large to represent in the type, a runtime error may occur.
ja: dividendをこの値で除算した商がこの型で表すのに大きすぎるならば、実行時エラーが起こります。

source: If the result is Result.success(_:), this publisher sends the specified output to all subscribers and finishes normally.
ja: 結果がResult.success(_:)ならば、このパブリッシャーは指定された出力をすべての加入者に送信します、そして正常に終了します。

source: If the result is Result.failure(_:), then the publisher fails immediately with the specified error.
ja: 結果がResult.failure(_:)ならば、そのときパブリッシャーは指定されたエラーで直ちに終了します。

source: If the return value of this method is non-nil, then accessing the value by key path or by an offset pointer are equivalent.
ja: このメソッドの戻り値が非nilならば、その時その値にキーパスによってまたはあるオフセットポインタによってアクセスすることは、等価です。

source: If the sequence has no elements, nextPartialResult is never executed and initialResult is the result of the call to reduce(_:_:).
ja: シーケンスが１つも要素を持たないならば、nextPartialResultは決して実行されません、そしてinitialResultはreduce(_:_:)への呼び出しの結果となります。

source: If the sequence has no elements, updateAccumulatingResult is never executed and initialResult is the result of the call to reduce(into:_:).
ja: シーケンスが１つも要素を持たないならば、updateAccumulatingResultは決して実行されません、そしてinitialResultはreduce(into:_:)への呼び出しの結果となります。

source: If the sequence has no elements, returns nil.
ja: シーケンスが要素を持たないならば、nilを返します。

source: If the sequence has no elements, the result is initialResult.
ja: シーケンスが１つも要素を持たないならば、結果はinitialResultです。

source: If the sequence is empty, this method returns true.
ja: シーケンスが空ならば、このメソッドはtrueを返します。

source: If the set already contains one or more elements that are also in other, the existing members are kept.
ja: otherの中にもある１つ以上の要素をこの集合がすでに含むならば、既存のメンバはそのままにしておかれます。

source: If the set is empty, endIndex is equal to startIndex.
ja: 集合が空ならば、endIndexはstartIndexと等しいです。

source: If the set is empty, startIndex is equal to endIndex.
ja: 集合が空ならば、startIndexはendIndexと等しいです。

source: If the set is empty, returns nil.
ja: 集合が空ならば、nilが返されます。

source: If the set wraps a bridged NSSet, the performance is unspecified.
ja: 集合が、ブリッジされたNSSetをラップするならば、性能は不特定です。

source: If the two ranges do not overlap, the result is an empty range within the bounds of limits.
ja: ２つの範囲が重ならないならば、結果はlimitsの境界内の空の範囲です。

source: If the value fails to encode anything, encoder will encode an empty keyed container in its place.
ja: 値が何かをエンコードに失敗するならば、encoderは空のキー付きコンテナをその場でエンコードします。

source: If the value is nil, it can be because key is computed, has observers, requires reabstraction, or overlaps storage with other properties.
ja: 値がnilの場合、それが可能なのはkeyが計算される、オブザーバを持つ、再抽象化を要求する、またはストレージを他のプロパティでオーバーラップするからです。

source: If the value passed as source is greater than the maximum representable value in this type, the result is the type’s max value.
ja: sourceとして渡された値がこの型において最大限の表現可能な値より大きいならば、結果はこの型のもつmax値です。

source: If the value passed as source is not representable exactly, the result is nil.
ja: sourceとして渡された値が正確に表現可能でないならば、結果はnilです。

source: If there is no value of the type that corresponds with the specified raw value, this initializer returns nil.
ja: 指定された生の値に対応する型の値が１つもないならば、このイニシャライザはnilを返します。

source: If there's a chance that a closure you pass to an API won't be called, don't put code that's critical to continuing your app in the closure.
ja: あなたがAPIに渡すクロージャが呼び出されない可能性があるならば、あなたのアプリを継続するのに重要なコードをクロージャの中に置かないでください。

source: If this instance is nil, returns nil.
ja: このインスタンスがnilならば、nilを返します。

source: If this type has value semantics, the mirror should be unaffected by subsequent mutations of the instance.
ja: この型が値意味論を持つならば、ミラーはインスタンスのその後の変化によって影響を受けないべきです。

source: If you are adding a known number of elements to a collection, use this method to avoid multiple reallocations.
ja: あなたが数のわかった要素をコレクションに加えているならば、このメソッドを使って複数の再割り当てを避けてください。

source: If you are adding a known number of elements to a set, use this method to avoid multiple reallocations.
ja: あなたが数のわかった要素を集合に加えているならば、このメソッドを使って複数の再割り当てを避けてください。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison instead.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、代わりにString APIを使うべきです、それはローカライズされた比較を実行します。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、String APIを使うべきです、それはローカライズされた比較を実行します。

source: If you misunderstand the requirements of closeFile(), you might place the call inside the closure.
ja: あなたがcloseFile()の必要条件を取り違えるならば、あなたは呼び出しをクロージャの内側に置くかもしれません。

source: If you mutate the collection while iterating over its indices, a strong reference can cause an unexpected copy of the collection.
ja: あなたがコレクションをそれのインデックス全体に反復している間に変化させるならば、ある強い参照はそのコレクションの予期されない複製の原因となります。

source: If you mutate the collection while iterating over its indices, a strong reference can result in an unexpected copy of the collection.
ja: あなたがコレクションをそれのインデックス全体に反復している間に変化させるならば、ある強い参照はそのコレクションの予期しない複製という結果になります。

source: If you need a reversed collection of the same type, you may be able to use the collection’s sequence-based or collection-based initializer.
ja: あなたが同じ型での逆にされたコレクションを必要とするならば、あなたはコレクションのもつシーケンス基盤のまたはコレクション基盤のイニシャライザを使うことができるでしょう。

source: If you need an integer value within a specific range, use the static random(in:using:) method on that integer type instead of this method.
ja: あなたがある整数を指定範囲内で必要とするならば、静的random(in:using:)メソッドをその整数型の上で使ってください、このメソッドの代わりに。

source: If you need to infer moves, call the inferringMoves() method on the resulting difference.
ja: あなたが移動の推論を必要とするならば、inferringMoves()メソッドを結果の差異の上で呼び出してください。

source: If you need to iterate over consecutive floating-point values, see the stride(from:to:by:) function.
ja: あなたが隣接浮動小数点値のすべてにわたって反復する必要があるならば、stride(from:to:by:)関数を見てください。

source: If you need to provide a customized playground representation in Swift 4.0 or Swift 3.2 or earlier, use a conditional compilation block:
ja: あなたがカスタマイズされたプレイグラウンド表現をSwift 4.0またはSwift 3.2以前において提供する必要があるならば、条件コンパイルブロックを使ってください：

source: If you pass a zero-length range as the subrange parameter, this method inserts the elements of newElements at subrange.startIndex.
ja: あなたがゼロ長範囲をsubrangeパラメータとして渡すならば、このメソッドはnewElementsの要素をsubrange.startIndexで挿入します。

source: If you pass strings to the descendant(_:_:) method, labels are used for lookup.
ja: あなたが幾つか文字列をdescendant(_:_:)メソッドに渡すならば、それらラベルは検索に使われます。

source: If you pass the collection’s endIndex property as the index parameter, the new element is appended to the collection.
ja: あなたがコレクションのendIndexプロパティをindexパラメータとして渡すならば、新しい要素がコレクションに追加されます。

source: If you pass the collection’s endIndex property as the index parameter, the new elements are appended to the collection.
ja: あなたがコレクションのendIndexプロパティをindexパラメータとして渡すならば、いくらかの新しい要素がコレクションに追加されます。

source: If you provide your own implementation, make sure to compute the value nondestructively.
ja: あなたがあなた独自の実装を提供するならば、値を非破壊的に計算することを確実にしてください。

source: If you use 11 as rhs, x is overshifted such that all of its bits are set to zero.
ja: あなたが11をrhsとして使うならば、xは、それのビットのすべてがゼロに設定されるような、オーバーシフトをされます。

source: If you use 2 as the right-hand-side value in an operation on x, the shift amount requires no masking.
ja: あなたが2を右手側の値としてxに関する演算において使うならば、シフト量はマスクを必要としません。

source: If you use 2 as the right-hand-side value in an operation on x, the value is shifted left by two bits.
ja: あなたが2をx上での演算の右手側の値として使うならば、値は2ビットだけ左にシフトされます。

source: If you use 2 as the right-hand-side value in an operation on x, the value is shifted right by two bits.
ja: あなたが2をx上での演算の右手側の値として使うならば、値は2ビットだけ右にシフトされます。

source: If you want to expose an Objective-C API to Swift with a different declaration, but a similar underlying implementation, use the NS_REFINED_FOR_SWIFT macro.
ja: あなたがObjective-C APIをSwiftに異なる宣言で、しかしよく似た基盤実装で公開したいならば、NS_REFINED_FOR_SWIFTマクロを使ってください。

source: If you want to import an Objective-C API into Swift with a different name, use the NS_SWIFT_NAME macro.
ja: あなたがあるObjective-C APIをSwiftへ異なる名前でインポートしたいならば、NS_SWIFT_NAMEマクロを使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow addition operator (&+).
ja: あなたがオーバーフロー検査を取りやめて、あらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー加算演算子（&+）を使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow multiplication operator (&*).
ja: あなたがオーバーフロー検査を取りやめて、あらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー乗算演算子（&*）を使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow subtraction operator (&-).
ja: あなたがオーバーフロー検査を取りやめてあらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー減算演算子（&-）を使ってください。

source: If you will be adding a known number of elements to a collection, use this method to avoid multiple reallocations.
ja: あなたが数のわかった要素をコレクションに加えることになっているならば、このメソッドを使って複数の再割り当てを避けてください。

source: If you're going to pass a closure to an API that might call it multiple times, omit code that's intended to make a one-time change to external state.
ja: あなたがあるクロージャをそれを複数回呼び出すかもしれないAPIに渡そうとしているならば、一度限りの変更を外部状態に対してするように意図されるコードを省いてください。

source: If you’re passing a generator that results in the same sequence of elements each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じ要素からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re passing a generator that results in the same sequence of integer values each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じ整数値からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re passing a generator that results in the same shuffled order each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じシャッフルされた順番という結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re working directly with numeric values, use the addition operator (+) instead of this method.
ja: あなたが直接に数値を扱っているならば、加算演算子（+）をこのメソッドの代わりに使ってください。

source: Implement this method to conform to the Hashable protocol.
ja: このメソッドを実装して、Hashableプロトコルに準拠してください。

source: Implementing an iterator that conforms to IteratorProtocol is simple.
ja: IteratorProtocolに準拠するイテレータを実装するのは簡単です。

source: Implements the Publisher protocol by accepting the subscriber and immediately publishing the optional’s value if it has one, or finishing normally if it doesn’t.
ja: Publisherプロトコルを、加入者を受け入れるそして直ちにオプショナルのもつ値を出版すること、またはそれがそうしないならば普通に終了することによって実装します。

source: Implements the publisher protocol by accepting the subscriber if the result is success, or terminating with an error immediately if it’s failure.
ja: パブリッシャープロトコルを、もし結果が成功するならば加入者を受け入れる、またはもしそれが失敗するならばエラーで直ぐに終了することによって実装します。

source: Import Related Functions into Swift
ja: 関連する関数をSwiftにインポートする

source: Import relevant system frameworks.
ja: 関連のあるシステムフレームワークをインポートしてください。

source: Important
ja: 重要

source: Imported C and Objective-C APIs
ja: インポートされたCおよびObjective-C API

source: Improving Objective-C API Declarations for Swift
ja: Objective-C API宣言をSwift用に改める

source: In Objective-C, you work with references to objects by using pointers that can be null, called nil in Objective-C.
ja: Objective-Cでは、あなたはオブジェクトへの参照をヌル、Objective-Cにおいてnilと呼ばれるもの、であることが可能なポインタを使用して扱います。

source: In Swift, all values — including object instances — are guaranteed to be non-null.
ja: Swiftでは、すべての値は — オブジェクトインスタンスを含めて — 非ヌルであることが保証されます。

source: In Swift, only class instances and metatypes have unique identities.
ja: Swiftでは、クラスインスタンスとメタタイプだけが固有な識別子を持ちます。

source: In Swift, the UITableViewCellStyle enumeration is imported like this:
ja: Swiftでは、UITableViewCellStyle列挙はこのようにインポートされます：

source: In Swift, you use the @available attribute to control whether a declaration is available to use when building an app for a particular target platform.
ja: Swiftでは、あなたは@available属性を使うことで、あるアプリを特定の対象プラットホーム用にビルドする時に、ある宣言が利用に応じられるかを制御します。

source: In a Repeated collection, endIndex is always equal to count.
ja: Repeatedコレクションにおいて、endIndexは常にcountと等しいです。

source: In a Repeated collection, startIndex is always equal to zero.
ja: Repeatedコレクションにおいて、startIndexは常にゼロと等しいです。

source: In a collection, the subsequence should also conform to Collection.
ja: あるコレクションにおいて、下位シーケンスはまたCollectionに準拠すべきです。

source: In a mirror created with this ancestor representation, the superclassMirror property is nil.
ja: この先祖表現で作成されるミラーにおいて、superclassMirrorプロパティはnilです。

source: In addition to changing the value of an individual element, you can also change the values of a slice of elements in a mutable collection.
ja: ある一個の要素の値を変えることに加えて、あなたはまた可変コレクションの要素のスライスに属するいくらかの値を変更することもできます。

source: In addition to the Set type’s set operations, you can use any nonmutating sequence or collection methods with a set.
ja: Set型のもつ集合演算に加えて、あなたはあらゆる非可変のシーケンスまたはコレクションメソッドを集合で使うことができます。

source: In addition to using an array literal, you can also create a set using these initializers.
ja: 配列リテラルを使うことに加えて、あなたはまた集合をこれらのイニシャライザを使って作成できます。

source: In addition, because abs(_:) always returns a value of the same type, even in a generic context, using the function instead of the magnitude property is encouraged.
ja: 加えて、abs(_:)は常に同じ型の値を返すことから、総称体の文脈においてさえも、この関数をmagnitudeプロパティの代わりに使うことは推奨されます。

source: In addition, because class instance properties are always stored out-of-line, their positions are not accessible using offset(of:).
ja: その上、クラスインスタンスプロパティは常にアウトオブラインに格納されることから、それらの位置はoffset(of:)によってアクセス可能ではありません。

source: In an empty collection, startIndex == endIndex.
ja: 空のコレクションでは、startIndex == endIndex。

source: In an empty range, lowerBound is equal to upperBound.
ja: 空の範囲では、lowerBoundはupperBoundに等しいです。

source: In an empty range, upperBound is equal to lowerBound.
ja: 空の範囲では、upperBoundはlowerBoundに等しいです。

source: In asynchronous APIs, the result won't be available until sometime later; this difference affects how you write code both in your closure as well as the code following your closure.
ja: 非同期APIでは、結果はいつか後まで利用可能でないでしょう；この違いは、あなたがコードを書く方法に、あなたのクロージャにおいてそれだけでなくあなたのクロージャの後のコードの両方で影響します。

source: In code, the absence of a value is typically written using the nil literal rather than the explicit .none enumeration case.
ja: コードにおいて、ある値の不在は一般的にnilリテラルを使って書かれます、明示的な.none列挙ケース節ではなく。

source: In contrast with the Just publisher, which always produces a single value, this publisher might not send any values and instead finish normally, if output is nil.
ja: 常にある単一の値を生み出すJustパブリッシャーと対照的に、このパブリッシャーは全く値を送信しないで代わりに正常に終了するかもしれません、もしoutputがnilであるならば。

source: In contrast with the Just publisher, which always publishes a single value, this publisher might not send any values and instead finish normally if the optional’s output is nil.
ja: 常にある単一の値を出版するJustパブリッシャーと対照的に、このパブリッシャーは全く値を送信しないで代わりに正常に終了するかもしれません、もしoutputがnilであるならば。

source: In contrast with the Just publisher, which always publishes a single value, this publisher might not send any values and instead terminate with an error, if the result is Result.failure(_:).
ja: 常に単一の値を出版するJustパブリッシャーと対照的に、このパブリッシャーは全く値を送信しないで代わりにエラーで終了するかもしれません、もし結果がResult.failure(_:)であるならば。

source: In debug builds (-Onone), the unsafelyUnwrapped property has the same behavior as using the postfix ! operator and triggers a runtime error if the instance is nil.
ja: デバッグビルド（-Onone）において、unsafelyUnwrappedプロパティは後置!演算子を使うのと同じ挙動を持ち、そしてインスタンスがnilならば実行時エラーの引き金となります。

source: In fact, s.flatMap(transform) is equivalent to Array(s.map(transform).joined()).
ja: 実際のところ、s.flatMap(transform)はArray(s.map(transform).joined())に等しいです。

source: In general, though, the observability of mutations is unspecified.
ja: もっとも、一般的に変異体の観察性は未規定です。

source: In many cases, only one sequence of calls is correct for your app, so it's important to think through what the state of your app will be, given the APIs you're using.
ja: 多くの場合に、ただ１つの呼び出し順番だけがあなたのアプリにとって正しいです、それで重要なのは、あなたが使うAPIを与えられて、あなたのアプリの状態がどうなるのか考え抜くことです。

source: In most scenarios, you use the preserved result as part of broader functionality in your code.
ja: ほとんどの状況では、あなたは保全された結果をあなたのコードにおけるより幅広い機能性の一部として使います。

source: In other words, for ordinary collections c having bidirectional indices:
ja: 言い換えると、二方向性のインデックスを持つ通常のコレクションcは：

source: In particular, MemoryLayout<T>.size, when T is a class type, is the same regardless of how many stored properties T has.
ja: 特に、MemoryLayout<T>.sizeは、Tがクラス型の時、Tがどのくらい多くの格納プロパティを持つかに関係なく同じです。
